FemDesign.Geometry.Vector3d.#ctor
Parameterless constructor for serialization.

FemDesign.Geometry.Vector3d.#ctor(System.Double,System.Double,System.Double)
Construct FdVector3d by x, y and z components.
x:
y:
z:

FemDesign.Geometry.Vector3d.#ctor(FemDesign.Geometry.Point3d,FemDesign.Geometry.Point3d)
Construct FdVector3d by start and end points.
p0: Start point
p1: End point

FemDesign.Geometry.Vector3d.op_UnaryNegation(FemDesign.Geometry.Vector3d)
Reverse vector

FemDesign.Geometry.Vector3d.op_Subtraction(FemDesign.Geometry.Vector3d,FemDesign.Geometry.Vector3d)
Vector difference

FemDesign.Geometry.Vector3d.op_Multiply(FemDesign.Geometry.Vector3d,System.Int32)
Scale vector

FemDesign.Geometry.Vector3d.op_Multiply(System.Int32,FemDesign.Geometry.Vector3d)
Scale vector

FemDesign.Geometry.Vector3d.op_Multiply(FemDesign.Geometry.Vector3d,System.Double)
Scale vector

FemDesign.Geometry.Vector3d.op_Multiply(System.Double,FemDesign.Geometry.Vector3d)
Scale vector

FemDesign.Geometry.Vector3d.op_Implicit(FemDesign.Geometry.Point3d)~FemDesign.Geometry.Vector3d
Implicitly convert Point to Vector
point:

FemDesign.Geometry.Vector3d.op_Implicit(FemDesign.Geometry.LineEdge)~FemDesign.Geometry.Vector3d
Implicitly convert LineEedge to Vector
edge:

FemDesign.Geometry.Vector3d.Length
Calculate length of FdVector3d.

FemDesign.Geometry.Vector3d.Normalize
Normalize FdVector3d (i.e. scale so that length equals 1).

FemDesign.Geometry.Vector3d.Cross(FemDesign.Geometry.Vector3d)
Calculate cross-product of this FdVector3d and v FdVector3d.

FemDesign.Geometry.Vector3d.Dot(FemDesign.Geometry.Vector3d)
Calculate dot-product of this FdVector3d and v FdVector3d.

FemDesign.Geometry.Vector3d.Scale(System.Double)
Scale this FdVector3d by s.

FemDesign.Geometry.Vector3d.Reverse
Reverse this by negative scaling.
Returns:

FemDesign.Geometry.Vector3d.RotateAroundAxis(System.Double,FemDesign.Geometry.Vector3d)
Rotate this vector by an angle around an axis
axis:
angle:
Returns:

FemDesign.Geometry.Vector3d.Parallel(FemDesign.Geometry.Vector3d)
Check if this FdVector3d is parallel to v.
Returns 1 if parallel, -1 if antiparallel, 0 if not parallel

FemDesign.Geometry.Vector3d.To2d
Check if z-component is 0 and convert to 2d vector in XY-plane.
Returns:

FemDesign.Geometry.Vector3d.IsZero
Check if zero vector.
Returns: